// Arduino 1.8.1
////////////////////////////////////////////////////////////////////////////////////////////
/*НАСТРОЙКИ*/
////////////////////////////////////////////////////////////////////////////////////////////
#include <Arduino.h>

// РАСПИНОВКА:

// реле
#define RELE_HEATER_PIN A1   // (A1) rele 1
#define RELE_LIGHTER_PIN A2  // (A2) rele 2
#define RELE_COOLER_PIN A3   // (A3) rele 3

// термометр
#define DS18B20_VCC_PIN 2
#define DS18B20_DATA_PIN 3

// часы
#define DS3231_DATA_PIN A4
#define DS3231_CLK_PIN A5

// дисплей
#define DEF_LCD_INIT_PIN 8, 9, 4, 5, 6, 7  // настройка распиновки дисплея
#define DEF_LCD_KEY_PIN A0                 // вход кнопок, аналоговый вход A0
#define DEF_LCD_LIGHT_PIN 10               // подсветка дисплея пин
uint8_t screen_brightnes = 255;            // яркость дисплея 0 - 255

////////////////////////////////////////////////////////////////////////////////////////////

// ПРОЧИЕ НАСТРОЙКИ:

// запись дня контроллера в память при прошивке и настройка адреса памяти
// НЕ ТРОГАТЬ
#define SET_DAY_CONTROL_VAL_EN 0  // должен быть 0 настройка перезаписи EEPROM <<1 прошивка>>
#define R_ADDR 0                  // адрес EEPROM
#define R_ADDR_2 2                // адрес EEPROM 2
#define MAX_DAY_CONTROL_VAL 56    // max день контроллера
int8_t day_control_val = 1;       // день контроллера


// запускать часы при прошивке: 1 да, 0 нет. должен быть 0. <<1 прошивка>>
#define SET_CLOK_FOR_PROG 0

// задержка измерения в мс. чтобы датчик не нагревался от частых измерений
#define MEASUREMENT_DELAY 9400  // 9.4 с

// гистерезис нагревателя
float heat_histerezis = 0.5;

// гистерезис вентиляции
float cooling_histerezis = 1;

// тип управляющего сигнала реле
#define RELE_SIGNAL_TIPE 0

////////////////////////////////////////////////////////////////////////////////////////////

// РАСПИСАНИЕ:

float basic_schedule[MAX_DAY_CONTROL_VAL + 1][4] = {

	/*0*/  {0,0,0,0},  // stop. не трогать

	///*День*/ {температура гр,световой день часов, вентиляция ВКЛ минут, вентиляция ВЫКЛ минут}

	/*1*/ {34, 24, 0, 0},
	/*2*/ {34, 24, 0, 0},
	/*3*/ {34, 24, 0, 0},

	/*4*/ {32, 24, 1, 8},
	/*5*/ {32, 24, 1, 8},
	/*6*/ {32, 24, 1, 8},
	/*7*/ {32, 24, 1, 8},

	/*8*/ {30, 23, 1, 8},
	/*9*/ {30, 23, 1, 8},
	/*10*/{30, 23, 1, 8},
	/*11*/{30, 23, 1, 8},

	/*12*/{28, 22, 1, 7},
	/*13*/{28, 22, 1, 7},
	/*14*/{28, 22, 1, 7},
	/*15*/{28, 22, 1, 7},

	/*16*/{26, 20, 1, 7},
	/*17*/{26, 20, 1, 7},
	/*18*/{26, 20, 1, 7},
	/*19*/{26, 20, 1, 7},

	/*20*/{24, 20, 1, 5},
	/*21*/{24, 20, 1, 5},
	/*22*/{24, 20, 1, 5},
	/*23*/{24, 20, 1, 5},
	/*24*/{24, 20, 1, 5},
	/*25*/{24, 20, 1, 5},

	/*26*/{22, 20, 1, 5},
	/*27*/{22, 20, 1, 5},
	/*28*/{22, 20, 1, 5},
	/*29*/{22, 20, 1, 5},
	/*30*/{22, 20, 1, 5},
	/*31*/{22, 20, 1, 5},
	/*32*/{22, 20, 1, 5},
	/*33*/{22, 20, 1, 5},
	/*34*/{22, 20, 1, 5},
	/*35*/{22, 20, 1, 5},

	/*36*/{17, 22, 1, 4},
	/*37*/{17, 22, 1, 4},
	/*38*/{17, 22, 1, 4},
	/*39*/{17, 22, 1, 4},
	/*40*/{17, 22, 1, 4},
	/*41*/{17, 22, 1, 4},
	/*42*/{17, 22, 1, 4},
	/*43*/{17, 22, 1, 4},
	/*44*/{17, 22, 1, 4},
	/*45*/{17, 22, 1, 4},
	/*46*/{17, 22, 1, 4},
	/*47*/{17, 22, 1, 4},
	/*48*/{17, 22, 1, 4},
	/*49*/{17, 22, 1, 4},

	/*50*/{16, 23, 1, 4},
	/*51*/{16, 23, 1, 4},
	/*52*/{16, 23, 1, 4},
	/*53*/{16, 23, 1, 4},
	/*54*/{16, 23, 1, 4},
	/*55*/{16, 23, 1, 4},
	/*56*/{16, 23, 1, 4}
};

////////////////////////////////////////////////////////////////////////////////////////////